app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets" LIMIT 10
---
  def index
    @tweets = Tweet.limit(10)

SELECT "tweets".* FROM "tweets" WHERE (tweet_id=556597275926228995)
---
  def search
    Workers::FindTweets.perform_async params[:hashtag] unless params[:hashtag].blank?

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT 1  [["id", "10"]]
DELETE FROM "tweets" WHERE "tweets"."id" = $1  [["id", 10]]
---
  def destroy
    @tweet = Tweet.find(params[:id])
    @tweet.destroy